[
{"title": "Senior Software Engineering Manager", "category": "Site Reliability Engineering", "subcategory": "Google Cloud", "locations": ["Warsaw, Poland"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/138724898561237702-senior-software-engineering-manager-site-reliability-engineering-google-cloud", "job_id": "138724898561237702", "company": "Google", "post": "<div class=\"KwJkGe\"><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor’s degree in Computer Science, a related field, or equivalent practical experience.<br></li>\n<li>8 years of experience with data structures or algorithms.<br></li>\n<li>5 years of experience with software development in one or more programming languages<br></li>\n<li>3 years of people management experience, and experience designing, analyzing, and troubleshooting distributed systems.<br></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>Experience working in computing, distributed systems, storage, or networking.<br></li>\n<li>Expertise in designing, analyzing, and troubleshooting large-scale distributed systems.<br></li>\n<li>Ability to debug, optimize code, and to automate routine tasks.<br></li>\n<li>Systematic problem-solving approach, coupled with effective verbal and written communication skills.<br></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><p>Site Reliability Engineering (SRE) combines software and systems engineering to build and run large-scale, massively distributed, fault-tolerant systems. SRE ensures that Google's services—both our internally critical and our externally-visible systems—have reliability,  uptime appropriate to users' needs and a fast rate of improvement.  Additionally SRE’s will keep an ever-watchful eye on our systems capacity and performance. Much of our software development focuses on optimizing existing systems, building infrastructure and eliminating work through automation. <br><br>On the SRE team, you’ll have the opportunity to manage the complex challenges of scale which are unique to Google, while using your expertise in coding, algorithms, complexity analysis and large-scale system design.<br><br>SRE's culture of diversity, intellectual curiosity, problem solving and openness is key to its success. Our organization brings together people with a wide variety of backgrounds, experiences and perspectives. We encourage them to collaborate, think big and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to create an environment that provides the support and mentorship needed to learn and grow. <br><br><b>To learn more:</b> check out our books on <a href=\"https://landing.google.com/sre/book.html\">Site Reliability Engineering</a> or read a <a href=\"https://careers.google.com/stories/site-reliability-engineering-profile-google/\">career profile</a> about why a Software Engineer chose to join SRE.</p>\n<p>As an Engineering Manager, you'll lead a team and be responsible for products globally, providing technical leadership to key projects and empowering and developing teams to do the same.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.</p></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Lead a team of Software/Systems Engineers on projects for users and be directly responsible for uptime.</li>\n<li>Own end-to-end availability and performance of key services and build automation to prevent problem recurrence. Automate response to all non-exceptional service conditions.</li>\n<li>Lead by example, mentor the team and establish credibility through quality technical execution.</li>\n<li>Manage on-call rotations across continents, using a follow-the-sun model.</li>\n<li>Design, write and deliver software to improve the availability, scalability, latency and efficiency of Google's services.</li>\n</ul></div>"},
{"title": "Camera Software Engineer", "category": "Project Starline", "subcategory": null, "locations": ["Seattle, WA, USA", "Mountain View, CA, USA"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/121700076086010566-camera-software-engineer-project-starline", "job_id": "121700076086010566", "company": "Google", "post": "<div class=\"KwJkGe\"><div role=\"none\" class=\"xbCN0b KiNied M0TuQ\" data-announce-callout=\"true\" data-liveregiontext=\"Info Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Mountain View, CA, USA; Seattle, WA, USA.\" jscontroller=\"u3jeub\" jsaction=\"rcuQ6b:rcuQ6b;\"><div class=\"OJgC7b \"><div aria-hidden=\"true\" role=\"img\" aria-label=\"Info\" class=\"quEfK\" jsname=\"quEfK\"><i class=\"google-material-icons Auu9lc\" aria-hidden=\"true\">info_outline</i></div><span aria-hidden=\"true\" jsname=\"arU4oc\" class=\"v7dlUb\">X</span><span role=\"status\" aria-live=\"polite\" jsname=\"yW4uId\" class=\"v7dlUb\"></span><span jsname=\"MyVLbf\" class=\"MyVLbf\">Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <b>Mountain View, CA, USA; Seattle, WA, USA</b>.</span></div><span role=\"none\" class=\"GMWBfb NOIZeb\"><span role=\"none\" class=\"gdNP2\" jsname=\"gdNP2\"></span></span></div><br><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor’s degree or equivalent practical experience.<br></li>\n<li>2 years of experience with software development in one or more programming languages (e.g., C++) or 1 year of experience with an advanced degree.<br></li>\n<li>2 years of experience with data structures or algorithms.<br></li>\n<li>2 years of experience working with embedded operating systems.<br></li>\n<li>2 years of experience with cameras or Android development.<br></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>Master's degree or PhD in Computer Science or related technical fields.<br></li>\n<li>Experience in camera and ISP pipeline.<br></li>\n<li>Experience  in on-device system development (e.g., Linux/Android).</li>\n<li>Experience in MediaPipe.<br></li>\n<li>Experience with Android camera frameworks.</li>\n<li>Experience working with computer vision, augmented reality, Android camera.<br></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><p>Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.</p>\n<p>Project Starline is a technology project that combines advances in hardware and software to enable friends, families, and co-workers to feel together, even when they're cities apart. You will have the opportunity to have an impact working alongside researchers and engineers inventing the future of communication with Google products.<br></p><p>Labs is a group focused on incubating early-stage efforts in support of Google’s mission to organize the world’s information and make it universally accessible and useful. Our team exists to help discover and create new ways to advance our core products through exploration and the application of new technologies. We work to build new solutions that have the potential to transform how users interact with Google. Our goal is to drive innovation by developing new Google products and capabilities that deliver significant impact over longer timeframes.<br></p><p>The US base salary range for this full-time position is $136,000-$200,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.</p><p>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about <a href=\"https://careers.google.com/benefits/\">benefits at Google</a>.<br></p></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Design, develop, and maintain software for the smart camera pipeline.<br></li>\n<li>Deliver efficient production code for compute-constrained android devices.<br></li>\n<li>Own and develop camera features (e.g., design and coding, cross-functional validation and collaboration).<br></li>\n<li>Work with research scientists, and hardware/application/cloud engineers to create integrated products.<br></li>\n<li><div>Collaborate with teammates across the organization to advance development practices.</div></li>\n</ul></div>"},
{"title": "Specialist", "category": "Search and Performance Max", "subcategory": "Large Customer Sales", "locations": ["Gurgaon, Haryana, India", "Mumbai, Maharashtra, India"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/111573951011791558-specialist-search-and-performance-max-large-customer-sales", "job_id": "111573951011791558", "company": "Google", "post": "<div class=\"KwJkGe\"><div role=\"none\" class=\"xbCN0b KiNied M0TuQ\" data-announce-callout=\"true\" data-liveregiontext=\"Info Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Gurgaon, Haryana, India; Mumbai, Maharashtra, India.\" jscontroller=\"u3jeub\" jsaction=\"rcuQ6b:rcuQ6b;\"><div class=\"OJgC7b \"><div aria-hidden=\"true\" role=\"img\" aria-label=\"Info\" class=\"quEfK\" jsname=\"quEfK\"><i class=\"google-material-icons Auu9lc\" aria-hidden=\"true\">info_outline</i></div><span aria-hidden=\"true\" jsname=\"arU4oc\" class=\"v7dlUb\">X</span><span role=\"status\" aria-live=\"polite\" jsname=\"yW4uId\" class=\"v7dlUb\"></span><span jsname=\"MyVLbf\" class=\"MyVLbf\">Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <b>Gurgaon, Haryana, India; Mumbai, Maharashtra, India</b>.</span></div><span role=\"none\" class=\"GMWBfb NOIZeb\"><span role=\"none\" class=\"gdNP2\" jsname=\"gdNP2\"></span></span></div><br><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor's degree or equivalent practical experience.<br></li>\n<li>5 years of experience in digital media, sales, marketing, or product roles.<br></li>\n<li>Experience working with digital organizations.<br></li>\n<li>Experience identifying and recommending ways to improve product and customer strategy.<br></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>MBA or Master's degree in Digital Marketing.<br></li>\n<li>Experience in the performance ecosystem, with focus on accelerating customer success, business growth, and driving product adoption.</li>\n<li>Experience with the technical aspects of search and shopping advertising, and working with product teams on scalable business solutions.<br></li>\n<li>Experience as a specialist with in-depth expertise across Google Ads (e.g., Search, Performance Max, Shopping, and App Campaigns).<br></li>\n<li>Excellent analytical skills with the ability to process large data sets and identify patterns of significance.<br></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n<p>Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.</p></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Manage a book of business, working across the entire business cycle -- plan, pitch (together with in-country teams), and implement.<br></li>\n<li>Understand the client’s business goals thoroughly, and lead a holistic Search and Commerce strategy. <br></li>\n<li>Work with cross-site and cross-functional teams to drive short- and long-term account growth.<br></li>\n<li>Deliver outcomes and track product adoption for multiple customers by leading portions of projects that are integrated into overarching efforts, including campaign strategy development and monitoring/optimizing for spend and performance to meet and exceed customer business goals.<br></li>\n<li>Identify key stakeholders to build a network and contribute to cross-team collaborations.<br></li>\n</ul></div>"},
{"title": "Manager", "category": "State and Local", "subcategory": "Government Affairs and Public Policy", "locations": ["Boulder, CO, USA"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/95135515052778182-manager-state-and-local-government-affairs-and-public-policy", "job_id": "95135515052778182", "company": "Google", "post": "<div class=\"KwJkGe\"><div role=\"none\" class=\"xbCN0b KiNied M0TuQ\" data-announce-callout=\"true\" data-liveregiontext=\"Info The application window will be open until at least August 16th. This opportunity will remain online based on business needs which may be before or after the specified date.\" jscontroller=\"u3jeub\" jsaction=\"rcuQ6b:rcuQ6b;\"><div class=\"OJgC7b \"><div aria-hidden=\"true\" role=\"img\" aria-label=\"Info\" class=\"quEfK\" jsname=\"quEfK\"><i class=\"google-material-icons Auu9lc\" aria-hidden=\"true\">info_outline</i></div><span aria-hidden=\"true\" jsname=\"arU4oc\" class=\"v7dlUb\">X</span><span role=\"status\" aria-live=\"polite\" jsname=\"yW4uId\" class=\"v7dlUb\"></span><span aria-hidden=\"true\" jsname=\"MyVLbf\" class=\"MyVLbf\">The application window will be open until at least August 16th. This opportunity will remain online based on business needs which may be before or after the specified date.</span></div><span role=\"none\" class=\"GMWBfb NOIZeb\"><span role=\"none\" class=\"gdNP2\" jsname=\"gdNP2\"></span></span></div><br><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor's degree or equivalent practical experience.<br></li>\n<li>10 years of experience working on policy issues within government, think tanks, public interest groups, law, relevant industry associations, public affairs, political communications or political campaigns.<br></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>Experience in government relations, political campaigns, outreach, or research in the Rocky Mountain states region (e.g., Colorado, Utah, Arizona, New Mexico, and Nevada).<br></li>\n<li>Experience working with or in state/local government, or leading policy or public affairs work for third-party organizations (e.g., being a lobbyist or running campaigns).<br></li>\n<li>Familiarity with Internet/technology policy with demonstrated interest in keeping the Internet open and free.<br></li>\n<li>Ability to integrate public policy with business strategy and corporate development.<br></li>\n<li>Excellent leadership, communication, and collaboration skills.<br></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3>As a member of Google’s Government Affairs and Public Policy team, you'll be part of a diverse global government affairs team, working across regions, product areas, and functions. You’ll combine creativity and intellectual excellence with the organizational skills to manage various campaigns, projects and initiatives. In this role, you’ll advocate for Google to bring external perspectives back into the company to inform our perception and direction. You're passionate about the opportunity to shape the future of how we use and build technology for everyone.<br><br>The State and Local team is the primary external policy expert, storyteller, and agenda setter in our home states and priority geographies. We promote and protect Google’s products, services, and operations in state and local governments through direct issue education, relationship and coalition building, strategic community engagement, and political intelligence.<br><br><br>In this role, you will manage our various public policy and product-related agendas with policy makers inside and outside government with a focus on Colorado, Utah, Arizona, New Mexico, and Nevada and potentially other states.Google takes its responsibilities seriously, including engaging with government and other stakeholders on important public policy challenges. The Government Affairs and Public Policy (GAPP) team leads the company’s engagement with executive branch officials, legislators, regulators and third-parties in the formation of public policy. Working closely with Google leaders, GAPP seeks to identify key policy issues, listen carefully to others’ views and opinions, and distill and share the company’s perspective on those issues with external stakeholders. While we focus on challenges affecting the internet, our issue areas are increasingly broad and encompass many areas where public policy, business, and technology intersect.<div><br></div><div>The US base salary range for this full-time position is $182,000-$248,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. <br><br>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about <a href=\"https://careers.google.com/benefits/\">benefits at Google</a>.<br></div></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Help create a positive regulatory environment to allow growth, protect products, and promote a free and open internet. Help craft and monitor Google’s positions on current and forthcoming policy issues of importance to Google.<br></li>\n<li>Build relationships with elected officials, third parties and other leaders. Establish and implement strategies to communicate policy positions to key state and local government constituencies.<br></li>\n<li>Develop public affairs strategies to build relationships and strengthen our local community engagement. Work with cross-functional internal teams on local programming in the region. <br></li>\n<li>Work with trade associations, industry partners, non-profit groups, and other third-parties to promote and build support for Google’s policy positions.<br></li>\n<li>Advocate before the relevant elected officials and public entities (e.g., Governor, state legislature, state agencies, Mayor, local legislators, etc.) on behalf of Google and the interests of a free and open Internet.<br></li>\n</ul></div>"},
{"title": "Senior Security Engineer", "category": "Google Kubernetes Engine", "subcategory": null, "locations": ["Seattle, WA, USA"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/87018687214559942-senior-security-engineer-google-kubernetes-engine", "job_id": "87018687214559942", "company": "Google", "post": "<div class=\"KwJkGe\"><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor's degree or equivalent practical experience.<br></li>\n<li>5 years of experience with security assessments or security design reviews or threat modeling.<br></li>\n<li>5 years of experience with security engineering, computer and network security and security protocols.<br></li>\n<li>5 years of coding experience in one or more general purpose languages.<br></li>\n<li>1 year of experience leading teams in a technical capacity or leading technical risk analysis in an enterprise environment.<br></li>\n<li>Experience in Kubernetes.<br></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li><div><div><div>Experience in Google Kubernetes Engine.<br></div></div></div><div><div><br></div></div></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><p>There's no such thing as a \"safe system\" - only safer systems. Our Security team works to create and maintain the safest operating environment for Google's users and developers. As a Security Engineer, you help protect network boundaries, keep computer systems and network devices hardened against attacks and provide security services to protect highly sensitive data like passwords and customer information. Security Engineers work directly with network equipment and actively monitor our systems for attacks and intrusions. You also work with software engineers to proactively identify and fix security flaws and vulnerabilities.<br><br>You use your industry experience to own and drive the resolution of complex security incidents, policy questions and technical security issues.</p>\n<p>Google Kubernetes Engine (GKE), is a different kind of project in Cloud. Its core component Kubernetes which is also created and maintained by the team, is open source and has a vibrant community of external contributors.</p><div>In this role, you will focus on security for components of our systems, such as client devices, networking equipment and server infrastructure, addressing threats from all sources. You will be working on securing and hardening the Kubernetes and GKE service using a Risk based approach and strategically driving the team to achieve an overall Security.</div>The US base salary range for this full-time position is $161,000-$239,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. <br><br><div><div>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about <a href=\"https://careers.google.com/benefits/\">benefits at Google</a>.</div></div></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Identify security issues and implement and design security controls, tools, and services to improve security systems and processes.<br></li><li>Lead the team to develop secure operational practices, and provide security guidance for engineers to mitigate the top threats for the product.<br></li><li>Partner with Security teams across Google to build out a long term threat detection strategy for the product.<br></li><li><div>Review designs and look for security gaps, both with one-time reviews and longer term engagement.</div></li>\n</ul></div>"},
{"title": "Cloud Consulting Account Lead", "category": "Google Cloud (English)", "subcategory": null, "locations": ["Bengaluru, Karnataka, India", "Mumbai, Maharashtra, India"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/82119540292362950-cloud-consulting-account-lead-google-cloud-english", "job_id": "82119540292362950", "company": "Google", "post": "<div class=\"KwJkGe\"><div role=\"none\" class=\"xbCN0b KiNied M0TuQ\" data-announce-callout=\"true\" data-liveregiontext=\"Info Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Bengaluru, Karnataka, India; Mumbai, Maharashtra, India.\" jscontroller=\"u3jeub\" jsaction=\"rcuQ6b:rcuQ6b;\"><div class=\"OJgC7b \"><div aria-hidden=\"true\" role=\"img\" aria-label=\"Info\" class=\"quEfK\" jsname=\"quEfK\"><i class=\"google-material-icons Auu9lc\" aria-hidden=\"true\">info_outline</i></div><span aria-hidden=\"true\" jsname=\"arU4oc\" class=\"v7dlUb\">X</span><span role=\"status\" aria-live=\"polite\" jsname=\"yW4uId\" class=\"v7dlUb\"></span><span jsname=\"MyVLbf\" class=\"MyVLbf\">Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <b>Bengaluru, Karnataka, India; Mumbai, Maharashtra, India</b>.</span></div><span role=\"none\" class=\"GMWBfb NOIZeb\"><span role=\"none\" class=\"gdNP2\" jsname=\"gdNP2\"></span></span></div><br><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor's degree or equivalent practical experience.<br></li>\n<li>6 years of experience in a customer-facing role, driving customer development programs and working with executives.<br></li>\n<li>Experience managing customer organizational structures, developing technology programs, defining milestones, success criteria, resource allocation, and on-time delivery.<br></li>\n<li>Experience working with digital natives, using cloud-based solutions (e.g., IaaS, PaaS) and managing initiatives across Engineering, Sales, Support, Professional Services, and distributed teams.<br></li>\n<li>Ability to communicate in English fluently as this is a customer-facing role that requires interactions in English with local stakeholders.<br></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>Master's degree in Management, Technical or Engineering field.<br></li>\n<li>Experience partnering with digital natives from a people, process and technology perspective, identifying areas of improvement, and advocating for new technologies and products.<br></li>\n<li>Experience collaborating with channel partners and systems integrators.<br></li>\n<li>Knowledge of Google Cloud ecosystem.<br></li>\n<li>Excellent communication, presentation, and problem-solving skills.<br></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><p><b></b></p>\n<p>As a Consulting Account Lead, you will partner with customer’s technical and business executive leadership team to help with value realization, automate Application Development, and enable them to develop solutions, and deliver innovation to their end users. You will work with the account team to identify opportunities for partnership and to expand their use of Google Cloud products. You will focus on driving customer loyalty, ensuring Google Cloud value is being realized, and partner with customer technical executives to identify opportunities to drive innovation into their service offerings with Google Cloud. </p><p>In this role, you will lead the acceleration of service adoption of Google Cloud, guiding technical customers through the people, process, and technology facets of their Cloud adoption journey. You will work across customer-facing teams to ensure that a customer’s experience on Google Cloud exceeds their expectations. You will understand the customer’s business objectives and regularly engage with executive stakeholders across a cross-functional and geographically dispersed team to ensure Google is helping them achieve their goals. You will also travel 50% of the time as needed.<br></p><p>Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.</p></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Drive the adoption and onboarding of Google Cloud at key organizations to help customers realize the business value of partnership and offerings.</li>\n<li>Create value for customers by partnering to define success and building a joint plan with identified objectives, stakeholders, milestones, risks and metrics needed to achieve their goals.</li>\n<li>Understand strategic relationships with key stakeholders and customer’s business within their industry and develop roadmaps.</li>\n<li>Guide IT executives through the organizational changes needed to unlock the full value of the cloud, and help them staff, train, and align people and partners to deliver on their cloud transformation.</li>\n<li>Partner with customer-facing account teams and executives (e.g., sales, support, professional services, customer engineering, and partners) to develop strategic and technical plans that help customers achieve objectives.</li>\n</ul></div>"},
{"title": "Digital Marketing Strategist", "category": null, "subcategory": null, "locations": ["Gurugram, Haryana, India", "Hyderabad, Telangana, India"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/99738124816392902-digital-marketing-strategist", "job_id": "99738124816392902", "company": "Google", "post": "<div class=\"KwJkGe\"><div role=\"none\" class=\"xbCN0b KiNied M0TuQ\" data-announce-callout=\"true\" data-liveregiontext=\"Info Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Gurugram, Haryana, India; Hyderabad, Telangana, India.\" jscontroller=\"u3jeub\" jsaction=\"rcuQ6b:rcuQ6b;\"><div class=\"OJgC7b \"><div aria-hidden=\"true\" role=\"img\" aria-label=\"Info\" class=\"quEfK\" jsname=\"quEfK\"><i class=\"google-material-icons Auu9lc\" aria-hidden=\"true\">info_outline</i></div><span aria-hidden=\"true\" jsname=\"arU4oc\" class=\"v7dlUb\">X</span><span role=\"status\" aria-live=\"polite\" jsname=\"yW4uId\" class=\"v7dlUb\"></span><span jsname=\"MyVLbf\" class=\"MyVLbf\">Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <b>Gurugram, Haryana, India; Hyderabad, Telangana, India</b>.</span></div><span role=\"none\" class=\"GMWBfb NOIZeb\"><span role=\"none\" class=\"gdNP2\" jsname=\"gdNP2\"></span></span></div><br><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor's degree or equivalent practical experience.</li>\n<li>3 years of experience in digital marketing, sales, and multi-functional project management leadership with customer impact.<br></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>Experience managing insights, analytics, client management, or consulting oriented projects driving customer success with cross-functional stakeholders.<br></li>\n<li>Experience in cross-functional and multi-layered stakeholder project management, with proven track record of driving complex business outcomes and customer solutions through collaboration.<br></li>\n<li>Expertise in implementing, optimizing and managing digital advertising campaigns, as well as managing complex, transformative solutions with clients.<br></li>\n<li>Ability to work with investigative, problem-solving projects.<br></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing businesses grow. Using your relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n<p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of trusted advisors support customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li><div>Drive high-impact markets, customers and stakeholders through strategic multi-dimensional problem-solving and cross-functional collaboration, delivering an excellent experience to clients.<br></div></li>\n<li><div>Elevate complex multi-quarter projects by pitching/suggesting new proposals and lead project planning, project groups and execution. Be the subject matter expert in the region/business model.</div></li>\n<li><div><div><div><div><div><div>Develop advanced frameworks and customer solutions and help activate these with the customers for long-term trust and value and scale these across businesses and markets.</div></div></div></div></div></div></li>\n<li><div><div><div><div>Drive decision-making and thought-leadership with business in enabling business/performance growth through systematic interventions, and ensure the client portfolio sustains effective business growth.</div></div></div></div></li>\n<li>Provide coaching and mentorship to the wider team, and act as a trusted advisor with key stakeholders in driving critical business discipline activities such as Workflow, Pipeline, Vendor Utilization, Product Activation, and People Pillars.<br></li>\n</ul></div>"},
{"title": "Global Threat Analyst", "category": null, "subcategory": null, "locations": ["Bengaluru, Karnataka, India"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/77301766625862342-global-threat-analyst", "job_id": "77301766625862342", "company": "Google", "post": "<div class=\"KwJkGe\"><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor's degree or equivalent practical experience.<br></li>\n<li>Experience analyzing risk, authoring reports, and conducting briefings that provide stakeholders with insight about security concerns.<br></li>\n<li><div>Experience in a corporate, government, nonprofit or academic environment, working in support of decision-making processes.</div></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>7 years of experience analyzing strategic enterprise risk as it relates to security, economic, policy, and social developments that are big-picture and granular in nature.<br></li>\n<li>7 years of experience partnering with cross-functional teams and external counterparts to support business leaders, manage risk, and complete projects.<br></li>\n<li>Experience in analytics and risk analysis.<br></li>\n<li>Knowledge of culture, norms, and operating environments.<br></li>\n<li>Understanding of key stakeholders such as political parties, NGOs, and interest groups.<br></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><div><div><div><p>From keeping Googlers safe and secure to managing disruptive events, the ability to anticipate, prevent, detect, and act are the pillars of Google’s Global Security and Resilience Services (GSRS) team. As a member of GSRS you will help develop a culture where safety, security, and resilience are embedded into every facet of Google, including the creative process. You will help us continually identify, evaluate, and monitor enterprise risks that could affect business activities and provide business leaders the information they need to make critical decisions. You'll collaborate with cross-functional teams to create innovative strategies and develop programs that drive sustainable effectiveness.</p></div></div></div><p>From keeping Googlers safe and secure to managing disruptive events, the ability to anticipate, deter, detect, and act are the pillars of Google’s Global Security and Resilience Services (GSRS) team. As a member of GSRS you will help develop a culture where safety, security and resiliency are integrated into every facet of Google, including the creative process. You will help us continually identify, evaluate and monitor enterprise risks that could affect business activities and provide business leaders the information they need to make critical decisions. You'll collaborate with cross-functional teams to create innovative strategies and develop programs that drive sustainable effectiveness.</p></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Collect, analyze, and disseminate accurate and timely global business intelligence to support action plans based on impact, credibility, and likelihood. Assess risk based on ongoing or predicted events using risk analytic methodologies and structured analytic techniques on both qualitative and quantitative data. </li>\n<li>Help inform protocols and practices to assess and mitigate potential risks to Google, collaborating with departmental and cross-functional partners.</li>\n<li>Author analytic assessments about potential operational and strategic threats or risks to Google and disseminate to appropriate stakeholders to support their decision-making. Coordinate with counterparts and associated stakeholders to make intelligence based recommendations on mitigating risk. </li>\n<li>Work closely with the senior GSRS leaders in Asia-Pacific, help conceptualize and drive an analytic program focused on regional challenges, threats, and opportunities for Google.</li>\n</ul></div>"},
{"title": "Google Security Manager", "category": "Data Centers", "subcategory": null, "locations": ["Papillion, NE, USA"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/127964079326143174-google-security-manager-data-centers", "job_id": "127964079326143174", "company": "Google", "post": "<div class=\"KwJkGe\"><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor's degree or equivalent practical experience. </li>\n<li>5 years of experience managing, sourcing, or procuring business resources and vendors.<br></li>\n<li>5 years of experience coordinating or managing resources for data center locations, and leading operational or project based work and tasks.<br></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>5 years of experience coordinating or leading security.<br></li>\n<li>4 years of experience managing incidents and crises.<br></li>\n<li>2 years of experience with physical security system architecture, components, installation methods, administration, and troubleshooting.<br></li>\n<li>2 years of experience with data center technologies, infrastructure, and methodologies.<br></li>\n<li>Experience planning security operations or strategy for security programs.<br></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><p>Security is at the core of Google's design and development process: it is built into the DNA of our products. The same is true of our offices. You're an expert who shares our seriousness about security and our commitment to confidentiality. You'll collaborate with our Facilities Management team to create innovative security strategies, investigate breaches and create risk assessment plans for the future. You believe that providing effective security doesn't come at the expense of customer service - you will be our bodyguard (and our long lost pal).</p>\n<p>As a Google Security Manager, you will participate in security improvement projects and make significant contributions with minimal guidance. You will lead efforts, deliver value-added perspectives, and influence project direction. You will contribute cross-functionally, identify, and recommend multiple creative ways to solve defined problems. In addition, you will engage in community contributions to improve and sustain our culture and operations.</p><p>Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.<br><br>The US base salary range for this full-time position is $97,500-$143,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br><br>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about <a href=\"https://careers.google.com/benefits/\">benefits at Google</a>.<br></p></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Manage the daily operations of vendors providing services including security, training, and risk management for one or multiple cross-functional technical infrastructure locations.</li>\n<li>Act as a single point of escalation for defined security-related incidents having uncertain solutions.<br></li>\n<li>Drive security work to ensure one or more technical infrastructure locations are in compliance with all regional governmental and regulatory compliance requirements.</li>\n<li>Develop cross-functional strategies to keep operational costs to a minimum, improve efficiency, and maintain an appropriate security posture.</li>\n<li>Perform complex risk assessments and provide feedback to internal design teams for a variety of highly secure facilities.</li>\n</ul></div>"},
{"title": "Generative AI Lead", "category": "Google Cloud Consulting", "subcategory": null, "locations": ["Singapore"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/134800497822311110-generative-ai-lead-google-cloud-consulting", "job_id": "134800497822311110", "company": "Google", "post": "<div class=\"KwJkGe\"><div role=\"none\" class=\"xbCN0b KiNied M0TuQ\" data-announce-callout=\"true\" data-liveregiontext=\"Info Google will be prioritizing applicants who have a current right to work in Singapore, and do not require Google's sponsorship of a visa.\n\" jscontroller=\"u3jeub\" jsaction=\"rcuQ6b:rcuQ6b;\"><div class=\"OJgC7b \"><div aria-hidden=\"true\" role=\"img\" aria-label=\"Info\" class=\"quEfK\" jsname=\"quEfK\"><i class=\"google-material-icons Auu9lc\" aria-hidden=\"true\">info_outline</i></div><span aria-hidden=\"true\" jsname=\"arU4oc\" class=\"v7dlUb\">X</span><span role=\"status\" aria-live=\"polite\" jsname=\"yW4uId\" class=\"v7dlUb\"></span><span jsname=\"MyVLbf\" class=\"MyVLbf\"><p>Google will be prioritizing applicants who have a current right to work in Singapore, and do not require Google's sponsorship of a visa.</p></span></div><span role=\"none\" class=\"GMWBfb NOIZeb\"><span role=\"none\" class=\"gdNP2\" jsname=\"gdNP2\"></span></span></div><br><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor's degree in Computer Science, Information Systems, Engineering, or equivalent practical experience.<br></li>\n<li>7 years of experience in technical project management, stakeholder management, professional services, solution engineering, or technical consulting, and 1 year of experience in technical leadership.<br></li>\n<li>2 years of experience in people management.<br></li>\n<li>Experience in Artificial Intelligence applications (e.g., deep learning, natural language processing, computer vision, or pattern recognition), applied machine learning techniques, or using OSS frameworks (e.g., TensorFlow, PyTorch).<br></li>\n<li>Experience building Machine Learning (ML) solutions and developing applications using AI frameworks.<br></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>MBA or Master's degree in Computer Science, Mathematics, a related technical field, or equivalent practical experience.<br></li>\n<li>Experience building with Generative AI tools and techniques to solve business problems in particular conversational workloads.<br></li>\n<li>Experience with contact center technologies and platforms and building conversational applications.<br></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><p>The Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are developed for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n<p>As a Generative AI Lead, you will work closely with a regional technical team of field engineers. You will work with the AI practice lead to accommodate the demand for Generative AI skills, provide technical leadership across the region, and mentor a growing team. You'll work in small, high performing AI teams and bring your demonstrated technical and leadership acumen to a team responsible for ensuring the best experience for customers moving to Google Cloud. You will be responsible for providing technical solutions, managing relationships with our customers technical staff, and working with our Google Cloud partners. More than just providing excellent support to our partners and customers, you will identify hard problems and develop permanent, elegant solutions.</p><p>Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.</p></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Consult with customers on technical issues based on in-depth product and technical knowledge of Generative AI.</li>\n<li>Develop technical tools and assets. Document reproducible solutions for customers and partners.</li>\n<li>Provide technical leadership to a team of Strategic Cloud Engineers and Technical Consultants.</li>\n<li>Provide technical implementation support in customer environments, including guidance on implementation feasibility of cross-product integrations.</li>\n<li>Travel up to 30% of the time as needed.</li>\n</ul></div>"},
{"title": "Staff Product Design Engineer", "category": "Pixel Watch", "subcategory": null, "locations": ["San Diego, CA, USA"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/118714741492196038-staff-product-design-engineer-pixel-watch", "job_id": "118714741492196038", "company": "Google", "post": "<div class=\"KwJkGe\"><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor's degree in Mechanical Engineering, Product Design, or related field, or equivalent practical experience.<br></li>\n<li>8 years of experience designing mechanical components such as plastic or metal parts, mechanical assemblies, printed circuit boards, or flexes.<br></li>\n<li>8 years of experience using computer-aided design tools, such as NX and Teamcenter.<br></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>Master's degree in Mechanical Engineering, Product Design, or related field, or equivalent practical experience.<br></li>\n<li>12 years of experience in consumer product design.<br></li>\n<li>Experience shipping multiple consumer products in a lead or staff engineer role.<br></li>\n<li>Experience collaborating with suppliers around the world on part manufacturing and final assembly, including onsite factory support.<br></li>\n<li>Experience in system integration, including electro-mechanical components (e.g., audio, display, camera, antenna, etc.), waterproofing, thermals, grounding, or product architecture.<br></li>\n<li>Deep technical knowledge in multiple manufacturing methods used in consumer products.<br></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><p>As a member of a fast-paced multi-disciplinary team, you use your creativity and diverse range of engineering experience to explore solutions to a variety of engineering problems. As a mechanical engineer, you participate in the design, analysis, and prototyping of new concepts. You work in a manufacturing and product oriented development environment and collaborate with vendors and outside sources in order to see parts through to manufacture.</p>\n<p>The Google Pixel Watch team focuses on designing and delivering an exceptionally helpful wearable experience. The team works on shaping the future of Pixel devices and services through some of the most advanced designs, techniques, products, and experiences in consumer electronics. This includes bringing together the best of Google’s artificial intelligence, software, and hardware to build global wearable devices and create transformative experiences for users across the world.<br></p><div><p>As a Staff Product Design Engineer, you will design the next generation of Pixel wearables. You will drive the design, analysis, and prototyping of new concepts while working in a manufacturing and product-oriented development environment. You will work on a Product Design team that balances comfort, performance, and appearance in an innovative and harmonious design that complements and enables the technology. You’ll collaborate with external vendors and internal cross-functional teams such as Electrical Engineering, Antenna, Industrial Design, Reliability, Operations, Camera, and Product to define and deliver excellent products.</p></div><p>Google's mission is to organize the world's information and make it universally accessible and useful. Our Devices &amp; Services team combines the best of Google AI, Software, and Hardware to create radically helpful experiences for users. We research, design, and develop new technologies and hardware to make our user's interaction with computing faster, seamless, and more powerful. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, the Devices &amp; Services team is making people's lives better through technology.<br></p><p>The US base salary range for this full-time position is $168,000-$252,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. </p><p>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about <a href=\"https://careers.google.com/benefits/\">benefits at Google</a>.<br></p></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Work with a team of Product Design Engineers in delivering future Pixel Watches that meet program requirements and milestones. Serve as the Product Design Technical Lead for the team, providing design feedback and technical direction to peers in their day-to-day activities.<br></li>\n<li>Balance design considerations such as functionality, sustainability, reliability, human factors, manufacturability, and aesthetics. Ensure risks and top issues are identified and have clear strategies for resolution/mitigation.<br></li>\n<li>Own the CAD top-level assembly, drive system/product-level analyses and prototyping strategy, and ensure deliverables for simulation (e.g.,structural, thermal, antenna, audio, etc.) are met.<br></li>\n<li>Develop cross-functional solutions to complex, time-dependent issues by leading the team to identify the root cause of design, manufacturing, or reliability issues and develop corrective actions.<br></li>\n<li>Travel internationally to engineering builds to oversee mechanical validation, design, and assembly, 10-20% of the time.<br></li>\n</ul></div>"},
{"title": "Power and Performance Lead", "category": "Silicon AI/ML", "subcategory": null, "locations": ["Bengaluru, Karnataka, India"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/87335979399946950-power-and-performance-lead-silicon-aiml", "job_id": "87335979399946950", "company": "Google", "post": "<div class=\"KwJkGe\"><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor's degree in Electrical Engineering, Computer Engineering, Computer Science, or a related field, or equivalent practical experience.<br></li>\n<li>10 years of experience in development of complex ASICs.<br></li>\n<li>8 years of experience in architecture, micro-architecture, and design of ASICs/SoCs.<br></li>\n<li>Experience defining and driving power management and power delivery strategies.<br></li>\n<li>Experience in power modeling and driving low power implementations.<br></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>Experience with performance modeling tools.<br></li>\n<li>Knowledge of accelerator architectures and data center workloads.<br></li>\n<li>Knowledge of high performance and low power design techniques.<br></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><div><div>Be part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.<br></div></div>\n<p>In this role, you will be part of a team developing next generation AI accelerators for data centers. You will have dynamic, multi-faceted responsibilities in areas such as product definition, design, and implementation. Power and Performance are key focus areas for data centers, and you will play a vital role in shaping the future of data centers.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.</p></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Lead all aspects of power definition and implementation for AI/ML SoCs.<br></li>\n<li>Collaborate with the architecture team on power-performance trade-off analysis as part of product definition.<br></li>\n<li>Drive power management and power delivery schemes, power rail definitions, and implementation strategies working closely with platform and package teams. <br></li>\n<li>Model power envelopes at various workloads and performance points. <br></li>\n<li>Drive power estimation, modeling, power roll ups, and pre silicon and post silicon correlation. <br></li>\n</ul></div>"},
{"title": "Data Center Facilities Technician I", "category": "Mechanical", "subcategory": null, "locations": ["Las Vegas, NV, USA"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/119930801352516294-data-center-facilities-technician-i-mechanical", "job_id": "119930801352516294", "company": "Google", "post": "<div class=\"KwJkGe\"><h3>Minimum qualifications:</h3><ul>\n<li>Associate's degree, trade school certification, or other certified training in a related technical field, or equivalent practical experience.</li>\n<li>2 years of Mechanical/HVAC, experience in an industrial or commercial environment. <br></li>\n<li>Ability to participate in material handling tasks such as lifting, carrying or moving up to 50 lbs of equipment, the required use of OSHA standard safety equipment such as limited weight bearing work platforms, ladders, step stools and personal protective equipment (PPE) like safety harnesses.<br></li>\n<li>Ability to work non-standard hours and work rotations/shifts.</li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>2 years of experience in maintenance of mechanical/cooling distribution systems or construction/technical environment or a related field.<br></li>\n<li>Experience in data centers, hospitals, or power plants.<br></li>\n<li>Knowledge of mechanical systems used in a data center environment e.g. Chillers, Air handling units, pumps and Computer Room Air Conditioning/Computer Room Air Handling (CRAC/CRAH) units.<br></li>\n<li>Knowledge of meters, devices, sensors, and troubleshooting utilizing standard hand tools, digital metering, or calibration/diagnostic equipment.<br></li>\n<li>Ability to communicate with contractors who perform maintenance or upgrade work on the data center systems.<br></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><p>The Data Center team designs and operates some of the most sophisticated electrical engineering, mechanical engineering and HVAC systems in the world. Facilities Technicians at Google data centers operate, monitor and support physical facilities conditions. Some of these duties will include heating and cooling of air and water, power supply, generators, UPS systems, electrical distribution and control and monitoring systems. You regularly help inspect, maintain and repair various data center systems such as piping and non-critical electrical or mechanical system components). You provide daily assistance to senior technicians as you read blueprints/schematics, conduct tours of systems and assess their working order.<br><br>As an advocate for best practices, you develop creative approaches to reducing operational costs while improving overall data center efficiency. You ensure that environmental and safety standards are consistently met, identifying problems and making repairs quickly. In emergency situations or abnormal conditions, you manage data center performance issues and outages to minimize the recovery time from failures.</p>\n<p>In this role, you will operate, monitor, and support physical facilities conditions for Google's data centers.<br></p><p>The Data Center team designs and operates some of the most sophisticated electrical and HVAC systems in the world. We are a diverse, upbeat, creative, team-oriented group of engineers committed to building and operating powerful data centers.</p><p>The US base salary range for this full-time position is $66,500-$100,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. </p><p>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about <a href=\"https://careers.google.com/benefits/\">benefits at Google</a>.<br></p></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Inspect, maintain, and repair various data center systems such as piping and mechanical system components. <br></li>\n<li>Assist technicians as you read blueprints/schematics/sequence of operations, conduct tours of systems, and assess their working order.<br></li>\n<li>Maintain water pumps and treatment systems, Heating Ventilating and Air Conditioning (HVAC), control and monitoring systems.<br></li>\n<li>Maintain, and respond to abnormal conditions in the data center facilities systems and equipment.<br></li>\n<li>Support startup, commissioning, and integration of new mechanical equipment and systems into facilities infrastructure.<br></li>\n</ul></div>"},
{"title": "Marketing Insights Manager", "category": "Platforms and Devices", "subcategory": null, "locations": ["San Francisco, CA, USA", "New York, NY, USA", "Mountain View, CA, USA", "Los Angeles, CA, USA"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/103920117292638918-marketing-insights-manager-platforms-and-devices", "job_id": "103920117292638918", "company": "Google", "post": "<div class=\"KwJkGe\"><div role=\"none\" class=\"xbCN0b KiNied M0TuQ\" data-announce-callout=\"true\" data-liveregiontext=\"Info This role may also be located in our Playa Vista, CA campus.\nNote: By applying to this position you will have an opportunity to share your preferred working location from the following: New York, NY, USA; Mountain View, CA, USA; Los Angeles, CA, USA; San Francisco, CA, USA.\" jscontroller=\"u3jeub\" jsaction=\"rcuQ6b:rcuQ6b;\"><div class=\"OJgC7b \"><div aria-hidden=\"true\" role=\"img\" aria-label=\"Info\" class=\"quEfK\" jsname=\"quEfK\"><i class=\"google-material-icons Auu9lc\" aria-hidden=\"true\">info_outline</i></div><span aria-hidden=\"true\" jsname=\"arU4oc\" class=\"v7dlUb\">X</span><span role=\"status\" aria-live=\"polite\" jsname=\"yW4uId\" class=\"v7dlUb\"></span><span jsname=\"MyVLbf\" class=\"MyVLbf\"><p>This role may also be located in our Playa Vista, CA campus.</p>Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <b>New York, NY, USA; Mountain View, CA, USA; Los Angeles, CA, USA; San Francisco, CA, USA</b>.</span></div><span role=\"none\" class=\"GMWBfb NOIZeb\"><span role=\"none\" class=\"gdNP2\" jsname=\"gdNP2\"></span></span></div><br><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor's degree or equivalent practical experience. <br></li>\n<li>4 years of experience in management consulting, product management and strategy, or analytics in a technology company.<br></li>\n<li>Experience working with and analyzing data. <br></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>Master's degree or equivalent practical experience. <br></li>\n<li>5 years of marketing research experience. Experience includes working at a market research firm or working in a consumer insights/market research role within an organization.<br></li>\n<li>Experience in the research process, including research design, project management, data analysis, and synthesis of insights into a narrative.<br></li>\n<li>Experience with synthesizing, and connecting insights to marketing and go-to-market strategy.<br></li>\n<li>Experience in stakeholder communication, presence and relationship management, including ability to facilitate meetings to successful outcomes.<br></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><p>Product and Business Strategy Leaders bring together teams across Google’s functions to help products execute optimally. Our team pushes Google to scale at key points that refine our products and infrastructure by executing efficiently, bringing solid business sense and sound judgment, and working effectively across organizational lines.<br><br>Our roles often include components of strategy (e.g. analyzing and understanding new trends in the industry, building business plans), operations (e.g. running the cadence of organizations, connecting the operating lines between our functions), and communications. Our team partners with senior leadership to run important functions that cross-cut our existing organizations and deliver high impact projects. We help Engineers, PMs, UX, and all of our other functions to build amazing products that delight our users, and then get those products into their hands.</p>\n<p>In this role, you will be part of the strategy, operations, insights and analytics team within the platforms and devices team. You will drive consumer insights around how pixel can leverage social media to get our message to our target consumers. You will run qualitative and quantitative research, working closely with the broader insights and analytics team, as well as the global social center of excellence. You will also collaborate with the US go-to-market team to influence how our campaigns appear on social, which social channels are leveraged, and who we can or should reach.<br></p>The US base salary range for this full-time position is $117,000-$172,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.<br><br>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about <a href=\"https://careers.google.com/benefits/\">benefits at Google</a>.<br></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Become the global social insights expert, working on being seen and leveraged as the go-to-researcher for all things social within platforms and devices.<br></li>\n<li>Build research roadmap, working with the social center of excellence to understand needs and prioritize asks.<br></li>\n<li>Understand the role of social media and trusted voices in the broader phone customer journey and help teams find the right content and platforms accordingly.<br></li>\n<li>Determine how social media can best be leveraged to breakthrough in culture across sports, music, entertainment.<br></li>\n<li>Run testing of new social campaigns to factor in consumer feedback to go/no go decisions, as well as developing content.<br></li>\n</ul></div>"},
{"title": "Sales Lead", "category": "Mid-Market Sales", "subcategory": "Google Customer Solutions (English", "locations": ["Shenzhen, Guangdong Province, China"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/131815541185618630-sales-lead-midmarket-sales-google-customer-solutions-english-mandarin", "job_id": "131815541185618630", "company": "Google", "post": "<div class=\"KwJkGe\"><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor's degree in Business, a related field, or equivalent practical experience.<br></li>\n<li>11 years of experience in sales.<br></li>\n<li>5 years of experience in people management.<br></li>\n<li>3 years of experience in the China export market.<br></li>\n<li>Ability to communicate in English and Mandarin fluently to manage the client relationships in this market.<br></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>10 years of experience in a sales nature role.<br></li>\n<li>Experience managing with C-level customers and driving sales through relationships in the China market.<br></li>\n<li>Experience working with key stakeholders in multiple countries and people management experience.<br></li>\n<li>Experience managing and inspiring high-performing Sales teams.<br></li>\n<li>Experience in technology, media sales or cross-channel media planning, with excellent communication and people management skills.<br></li>\n<li>Excellent problem-solving, critical thinking and investigative skills.<br></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><p>With a rapidly growing array of sales teams, it's important to have knowledgeable, charismatic leaders to guide our client sales teams. As a Sales manager, you'll lead and coach high-performing account teams that use consultative sales skills to understand our advertisers' needs and deliver measurable solutions that grow their businesses. You will also work with the sales leadership team to set strategic objectives and run the day-to-day operations for the business. Sales managers willingly help their teams and roll up their sleeves to partner directly with clients to provide comprehensive service. You are an excellent communicator with a proven ability to train and motivate a large team, and you take an analytical approach to sales management.</p>\n<p>As a Sales Lead in Google Customer Solutions (GCS), you will be leading the mid-market sales team for China. You will manage a large amount of medium and potentially large-sized exporters directly, including both Business-to-Business (B2B) and Business-to-Consumer (B2C) business models with a variety of product categories, like Apparel, Jewelry, Computers, Consumer Electronics and Communication (3C) high tech, Education, Wigs, Travel, Business and Industrial Markets (BIM) etc. You will need to demonstrate a strong leadership for both business management and people management. <br></p><p>Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer to small- and medium-sized businesses (SMBs), which are the backbone of our communities. As a member of our team, you’ll have the opportunity to work with company owners and make a real difference in their businesses by helping them grow.  Together, we help shape the future of innovation for customers, partners, and sellers...and we have fun doing it.</p></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Lead the sales team to build a scalable and systematic approach to engage with our SMB customers who are always distributed in different tier 2 and tier 3 cities across China.</li>\n<li>Coach the sales team to further develop their sales skills in line with Google Way of Selling framework.</li>\n<li>Work with cross-functional teams to acquire the high potential customers and accelerate their business growth to the next level.</li>\n<li>Motivate the sales team with a strong and clear SMB value proposition, goals and strategy, and how the Scaled sales team can do things differently to improve operational efficiency and also further evolve this sales program.</li>\n<li>Interview and hire the applicants for Google.</li>\n</ul></div>"},
{"title": "Regional Delivery Head", "category": "Data Analytics", "subcategory": "Google Cloud Consulting", "locations": ["Tokyo, Japan", "Singapore"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/81271816290476742-regional-delivery-head-data-analytics-google-cloud-consulting", "job_id": "81271816290476742", "company": "Google", "post": "<div class=\"KwJkGe\"><div role=\"none\" class=\"xbCN0b KiNied M0TuQ\" data-announce-callout=\"true\" data-liveregiontext=\"Info For Japan Applicants:\nGoogle welcomes people with disabilities.\nNote: By applying to this position you will have an opportunity to share your preferred working location from the following: Singapore; Tokyo, Japan.\" jscontroller=\"u3jeub\" jsaction=\"rcuQ6b:rcuQ6b;\"><div class=\"OJgC7b \"><div aria-hidden=\"true\" role=\"img\" aria-label=\"Info\" class=\"quEfK\" jsname=\"quEfK\"><i class=\"google-material-icons Auu9lc\" aria-hidden=\"true\">info_outline</i></div><span aria-hidden=\"true\" jsname=\"arU4oc\" class=\"v7dlUb\">X</span><span role=\"status\" aria-live=\"polite\" jsname=\"yW4uId\" class=\"v7dlUb\"></span><span jsname=\"MyVLbf\" class=\"MyVLbf\"><p>For Japan Applicants:</p><p>Google welcomes people with disabilities.</p>Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <b>Singapore; Tokyo, Japan</b>.</span></div><span role=\"none\" class=\"GMWBfb NOIZeb\"><span role=\"none\" class=\"gdNP2\" jsname=\"gdNP2\"></span></span></div><br><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor's degree or equivalent practical experience.</li>\n<li>15 years of experience in consulting, IT services, or program and project management as a service delivery leader.<br></li>\n<li>Experience in cloud migration, cloud integration or any cloud-native, or cloud-based applications development.<br></li>\n<li>Experience in people management, leading service delivery teams.<br></li>\n<li>Experience in data analytics, data warehousing, data management software, or Business Intelligence (BI) technologies.</li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>Experience in leading migration, implementation and managed services operation of large, multi-year technology services engagements for complex, global organizations.<br></li>\n<li>Experience working within an ecosystem of technology partners.<br></li>\n<li>Ability to anticipate customer needs before they arise and quickly address and complete solutions, ensuring a thorough and seamless customer experience.<br></li>\n<li><div><div>Ability to drive constant innovation of techniques and methodologies, such as data/insight-driven improvements, develop better ways of delivering technology and serving customers.</div></div></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><p>The Google Cloud team helps companies, schools, and government seamlessly make the switch to Google products and supports them along the way. You listen to the customer and swiftly problem-solve technical issues to show how our products can make businesses more productive, collaborative, and innovative. You work closely with a cross-functional team of web developers and systems administrators, not to mention a variety of both regional and international customers. Your relationships with customers are crucial in helping Google grow its Cloud business and helping companies around the world innovate.</p>\n<p>In this role, you will be responsible for overall delivery success and continuous improvement of the data analytics service delivery operations in the region, including technical implementation services provided directly by Google Cloud professionals, as well as indirect services provided through Google Cloud’s network of strategic partners (e.g., Global System Integrators and other IT services providers in the partner ecosystem). You will engage and partner closely with the counterpart delivery leaders and relevant executives of the different Global System Integrators (GSI) partners of Google Cloud in an operating model that ensures success for all stakeholders. You will work closely with the cloud customer experience leaders of each major sub-region in JAPAC, including India, Japan, Southeast Asia, North Asia, Australia and New Zealand. You will also engage with executives of customer and internal cross-functional peer leaders in the cloud to ensure successful delivery of cloud data analytics service.</p><p>Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.</p></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Be responsible for overall success of technical implementation of cloud data analytics service delivery and continuous improvement of its operations in JAPAC, including India, Japan, Southeast Asia, North Asia, Australia and New Zealand.<br></li>\n<li>Manage performance of JAPAC team and establish a performance management system that systematically governs service delivery operation, including expedient escalation and resolution of issues, and proactive identification/anticipation of implementation issues.<br></li>\n<li>Partner with counterpart delivery leaders in implementation of cross-sector and cross-region delivery success initiatives, escalation and timely resolution of migration/implementation/delivery issues that arise in the course of customer’s cloud transformation.<br></li>\n<li>Stay updated on trends in data analytics product and services, formulate strategy and development agenda that integrate cloud service delivery with AI innovations.<br></li>\n<li>Partner closely with governing performance of the various Global System Integrators (GSIs).<br></li>\n</ul></div>"},
{"title": "Technical Program Manager Construction Technology Execution Lead", "category": null, "subcategory": null, "locations": ["New York, NY, USA", "Reston, VA, USA", "Sunnyvale, CA, USA", "Boulder, CO, USA"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/85428172643803846-technical-program-manager-construction-technology-execution-lead", "job_id": "85428172643803846", "company": "Google", "post": "<div class=\"KwJkGe\"><div role=\"none\" class=\"xbCN0b KiNied M0TuQ\" data-announce-callout=\"true\" data-liveregiontext=\"Info The application window will be open until at least September 11th, 2024. This opportunity will remain online based on business needs which may be before or after the specified date.Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Sunnyvale, CA, USA; Boulder, CO, USA; New York, NY, USA; Reston, VA, USA.\" jscontroller=\"u3jeub\" jsaction=\"rcuQ6b:rcuQ6b;\"><div class=\"OJgC7b \"><div aria-hidden=\"true\" role=\"img\" aria-label=\"Info\" class=\"quEfK\" jsname=\"quEfK\"><i class=\"google-material-icons Auu9lc\" aria-hidden=\"true\">info_outline</i></div><span aria-hidden=\"true\" jsname=\"arU4oc\" class=\"v7dlUb\">X</span><span role=\"status\" aria-live=\"polite\" jsname=\"yW4uId\" class=\"v7dlUb\"></span><span jsname=\"MyVLbf\" class=\"MyVLbf\">The application window will be open until at least September 11th, 2024. This opportunity will remain online based on business needs which may be before or after the specified date.Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <b>Sunnyvale, CA, USA; Boulder, CO, USA; New York, NY, USA; Reston, VA, USA</b>.</span></div><span role=\"none\" class=\"GMWBfb NOIZeb\"><span role=\"none\" class=\"gdNP2\" jsname=\"gdNP2\"></span></span></div><br><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor's degree or equivalent practical experience.</li>\n<li>5 years of experience in program or technical project management.<br></li>\n<li>5 years of experience with Revit, Autodesk Construction Cloud, and other Architecture, Engineering, and Construction (AEC) software database aligned with work breakdown structure in construction.<br></li>\n<li>5 years of experience in Design and Construction of a Data Center or Commercial projects including experience with computer-aided manufacturing (CAM) software.<br></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>Experience with product 3D CAD modeling tools (e.g., SolidWorks or ProEngineer) for manufacturing or construction technology and data management.<br></li>\n<li>Excellent communication skills for cross-functional collaboration.<br></li>\n<li>Excellent program management, project delivery, and analytical problem-solving skills.</li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><p>A problem isn’t truly solved until it’s solved for all. That’s why Googlers build products that help create opportunities for everyone, whether down the street or across the globe. As a Technical Program Manager at Google, you’ll use your technical expertise to lead complex, multi-disciplinary projects from start to finish. You’ll work with stakeholders to plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners across the company. You're equally comfortable explaining your team's analyses and recommendations to executives as you are discussing the technical tradeoffs in product development with engineers.<br><br>Our goal is to build a Google that looks like the world around us — and we want Googlers to stay and grow when they join us. As part of our efforts to build a Google for everyone, we build diversity, equity, and inclusion into our work and we aim to cultivate a sense of belonging throughout the company.</p>\n<p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.</p><p>The US base salary range for this full-time position is $142,000-$211,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.</p><p>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about <a href=\"https://careers.google.com/benefits/\">benefits at Google</a>.<br></p></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Track progress, communicate updates, and ensure stakeholder alignment, identify and address risks to keep projects on track.<br></li>\n<li>Evaluate project success and share insights across the organization.<br></li>\n<li>Use experience in the design and construction of data centers or commercial projects.<br></li>\n<li>Utilize knowledge of AEC software API integrations and their role in the construction ecosystem.<br></li>\n<li>Compare manufacturing and construction data structures, and use knowledge of MCAD software and data architecture principles.<br></li>\n</ul></div>"},
{"title": "Industry Architect", "category": "Health and Human Services", "subcategory": "Public Sector", "locations": ["In-office locations: Reston, VA, USA.", "Reston, VA, USA", "United States"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/84019911923245766-industry-architect-health-and-human-services-public-sector", "job_id": "84019911923245766", "company": "Google", "post": "<div class=\"KwJkGe\"><div role=\"none\" class=\"xbCN0b KiNied M0TuQ\" data-announce-callout=\"true\" data-liveregiontext=\"Info The application window will be open until at least August 30, 2024. This opportunity will remain online based on business needs which may be before or after the specified date.\n\nMust be a US Citizen to meet customer and compliance requirements, including potential access to classified information.\nNote: Google’s hybrid workplace includes remote and in-office roles. By applying to this position you will have an opportunity to share your preferred working location from the following:\n\nIn-office locations: Reston, VA, USA.\nRemote location(s): United States.\" jscontroller=\"u3jeub\" jsaction=\"rcuQ6b:rcuQ6b;\"><div class=\"OJgC7b \"><div aria-hidden=\"true\" role=\"img\" aria-label=\"Info\" class=\"quEfK\" jsname=\"quEfK\"><i class=\"google-material-icons Auu9lc\" aria-hidden=\"true\">info_outline</i></div><span aria-hidden=\"true\" jsname=\"arU4oc\" class=\"v7dlUb\">X</span><span role=\"status\" aria-live=\"polite\" jsname=\"yW4uId\" class=\"v7dlUb\"></span><span jsname=\"MyVLbf\" class=\"MyVLbf\">The application window will be open until at least August 30, 2024. This opportunity will remain online based on business needs which may be before or after the specified date.<div><br></div><div>Must be a US Citizen to meet customer and compliance requirements, including potential access to classified information.<br></div>Note: Google’s hybrid workplace includes remote and in-office roles. By applying to this position you will have an opportunity to share your preferred working location from the following:<br><br><b>In-office locations: Reston, VA, USA.</b><br><b>Remote location(s): United States.</b></span></div><span role=\"none\" class=\"GMWBfb NOIZeb\"><span role=\"none\" class=\"gdNP2\" jsname=\"gdNP2\"></span></span></div><br><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor's degree or equivalent practical experience.<br></li>\n<li>10 years of experience supporting Health and Human Services (HHS) technology systems with legacy applications and cloud-based solutions.<br></li>\n<li>Experience with modernization efforts in Health and Human Services (HHS),  supporting a transition from a legacy to cloud system.<br></li>\n<li>Experience engaging with, and presenting to, technical stakeholders and executive leaders.<br></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>Experience working directly within a state Health and Human Services (HHS) agency or technology vendor supporting the labor sector.<br></li>\n<li>Understanding of Google Cloud or other cloud-based technologies.<br></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><p>When leading companies choose Google Cloud, it's a huge win for spreading the power of cloud computing globally. Once educational institutions, government agencies, and other businesses sign on to use Google Cloud products, you come in to facilitate making their work more productive, mobile, and collaborative. You listen and deliver what is most helpful for the customer. You assist fellow sales Googlers by problem-solving key technical issues for our customers. You liaise with the product marketing management and engineering teams to stay on top of industry trends and devise enhancements to Google Cloud products.</p>\n<p>The Rapid Innovation Team (RIT) is focused on bringing the Google Culture of Innovation to our customers through proving mission challenges are possible. The RIT consists of Industry Executives and Practice Leads, as well as a build team that includes Technical Program Managers and Solutions Architects to bring customer's use cases to life and to others via scaling mechanisms.</p><p>As an Industry Architect, you will play a pivotal role in expanding Google's presence within the government sector. You will collaborate closely with sales, engineering, and other teams to identify and pursue growth opportunities within the target market.</p><p><a href=\"https://about.google/intl/ALL_us/public-sector/#:~:text=We're%20committed%20to%20advancing,%2C%20research%2C%20and%20edtech%20companies.\">Google Public Sector</a> brings the magic of Google to the mission of government and education with solutions purpose-built for enterprises. We focus on helping United States public sector institutions accelerate their digital transformations, and we continue to make significant investments and grow our team to meet the complex needs of local, state and federal government and educational institutions.<br></p><p>The US base salary range for this full-time position is $142,000-$214,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.</p><p>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about <a href=\"https://careers.google.com/benefits/\">benefits at Google</a>.<br></p></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Leverage deep Health and Human Services (HHS) process/technology knowledge to collaborate with Sales and Engineering on solution design. Translate business challenges into actionable SOWs and technical implementations, streamlining contracting and execution processes.<br></li>\n<li>Identify where existing solutions can be applied to additional pain points and challenges within state HHS agencies, uncovering overlooked opportunities for Google solutions.<br></li>\n<li>Establish trust and build rapport with key stakeholders within state HHS agencies, key vendor partners and other stakeholders (e.g. HHS/CMS). Foster deeper relationships to increase adoption and ensure long-term success.<br></li>\n<li>Contribute to Google's thought leadership in the HHS by providing insights into current and legacy HHS technologies, modernization trends, and the impacts of legislation on the sector.<br></li>\n</ul></div>"},
{"title": "Staff Software Engineer", "category": "Generative AI", "subcategory": "Data Analytics", "locations": ["New York, NY, USA", "Kirkland, WA, USA", "Sunnyvale, CA, USA"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/135214054854533830-staff-software-engineer-generative-ai-data-analytics", "job_id": "135214054854533830", "company": "Google", "post": "<div class=\"KwJkGe\"><div role=\"none\" class=\"xbCN0b KiNied M0TuQ\" data-announce-callout=\"true\" data-liveregiontext=\"Info Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Kirkland, WA, USA; New York, NY, USA; Sunnyvale, CA, USA.\" jscontroller=\"u3jeub\" jsaction=\"rcuQ6b:rcuQ6b;\"><div class=\"OJgC7b \"><div aria-hidden=\"true\" role=\"img\" aria-label=\"Info\" class=\"quEfK\" jsname=\"quEfK\"><i class=\"google-material-icons Auu9lc\" aria-hidden=\"true\">info_outline</i></div><span aria-hidden=\"true\" jsname=\"arU4oc\" class=\"v7dlUb\">X</span><span role=\"status\" aria-live=\"polite\" jsname=\"yW4uId\" class=\"v7dlUb\"></span><span jsname=\"MyVLbf\" class=\"MyVLbf\">Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <b>Kirkland, WA, USA; New York, NY, USA; Sunnyvale, CA, USA</b>.</span></div><span role=\"none\" class=\"GMWBfb NOIZeb\"><span role=\"none\" class=\"gdNP2\" jsname=\"gdNP2\"></span></span></div><br><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor's degree or equivalent practical experience.<br></li>\n<li>8 years of experience in software development, and with data structures/algorithms.<br></li>\n<li>5 years of experience testing, and launching software products, and 3 years of experience with software design and architecture.<br></li>\n<li>4 years or more of experience with AI/ML algorithms and tools, deep learning or natural language processing.<br></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>Master’s degree or PhD in Engineering, Computer Science, or a related technical field.<br></li>\n<li>3 years of experience in a technical leadership role leading project teams and setting technical direction.<br></li>\n<li>3 years of experience working in an organization involving cross-functional or cross-business projects.<br></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><p>Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.</p>\n<p>In this role, you will be responsible for designing and developing next-generation software systems at the intersection of data analytics (e.g., data warehousing, business intelligence, spark, dataflow, data catalog) and Generative AI. You will work with the team of experts to research, explore, and develop innovative solutions that will bring Generative AI to the forefront of Google Cloud Platform (GCP) data analytics for customers.<br></p><p>Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.</p><p>The US base salary range for this full-time position is $189,000-$284,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.</p><p>Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about <a href=\"https://careers.google.com/benefits/\">benefits at Google</a>.<br></p></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Provide technical leadership on projects.<br></li>\n<li>Influence and coach a distributed team of engineers.<br></li>\n<li>Support alignment and clarity across teams on goals, outcomes, and timelines.<br></li>\n<li>Manage project priorities, deadlines, and deliverables.<br></li>\n<li>Design, develop, test, deploy, maintain, and enhance software solutions.<br></li>\n</ul></div>"},
{"title": "AI Sales Specialist", "category": null, "subcategory": null, "locations": ["Berlin, Germany", "Frankfurt, Germany", "Hamburg, Germany", "Munich, Germany"], "job_url": "https://www.google.com/about/careers/applications/jobs/results/83545804442084038-ai-sales-specialist", "job_id": "83545804442084038", "company": "Google", "post": "<div class=\"KwJkGe\"><div role=\"none\" class=\"xbCN0b KiNied M0TuQ\" data-announce-callout=\"true\" data-liveregiontext=\"Info Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Berlin, Germany; Frankfurt, Germany; Hamburg, Germany; Munich, Germany.\" jscontroller=\"u3jeub\" jsaction=\"rcuQ6b:rcuQ6b;\"><div class=\"OJgC7b \"><div aria-hidden=\"true\" role=\"img\" aria-label=\"Info\" class=\"quEfK\" jsname=\"quEfK\"><i class=\"google-material-icons Auu9lc\" aria-hidden=\"true\">info_outline</i></div><span aria-hidden=\"true\" jsname=\"arU4oc\" class=\"v7dlUb\">X</span><span role=\"status\" aria-live=\"polite\" jsname=\"yW4uId\" class=\"v7dlUb\"></span><span jsname=\"MyVLbf\" class=\"MyVLbf\">Note: By applying to this position you will have an opportunity to share your preferred working location from the following: <b>Berlin, Germany; Frankfurt, Germany; Hamburg, Germany; Munich, Germany</b>.</span></div><span role=\"none\" class=\"GMWBfb NOIZeb\"><span role=\"none\" class=\"gdNP2\" jsname=\"gdNP2\"></span></span></div><br><h3>Minimum qualifications:</h3><ul>\n<li>Bachelor's degree or equivalent practical experience.</li>\n<li>7 years of experience promoting IT business solutions and executing a territory sales strategy.<br></li>\n<li>Experience identifying and driving use cases to solve customer issues.<br></li>\n<li>Experience partnering with technical staff to build business cases and implementation plans.<br></li>\n</ul><br><h3>Preferred qualifications:</h3><ul>\n<li>Experience working with and managing partners in complex implementation projects, including global system integrators and packaged software vendors.<br></li>\n<li>Experience in promoting the AI technology stack.<br></li>\n<li>Experience working with product teams and an understanding of how to embed technology into the product set.<br></li>\n<li>Familiarity with Google Cloud and Google Cloud AI offerings.<br></li>\n<li>Ability to connect AI/ML with business value and engage executive stakeholders as an advisor and thought leader.<br></li>\n<li>Ability to drive business growth across a broad set of industry-specific AI/ML use cases.<br></li>\n</ul></div><div class=\"aG5W3\"><h3>About the job</h3><p>As an AI Sales Specialist Specialist, you will be responsible for growing our AI business by building and expanding relationships with new and existing customers. You will develop relationships with external customer stakeholders, identifying innovative ways to multiply the impact of the team. You will partner with internal Google Cloud Platform (GCP) Sales teams to grow their AI businesses and drive overall value for GCP.<br></p><p>Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.</p></div><div class=\"BDNOWe\"><h3>Responsibilities</h3><ul>\n<li>Calibrate the business against the objectives and key results. Forecast and report the state of the business for the territory.<br></li>\n<li>Build and maintain executive relationships with customers as the AI subject matter expert, influence long-term strategic direction for the new and existing customers, as well as the Google Cloud Field Sales Representatives (FSRs) and Customer Engineers (CEs).<br></li>\n<li>Assist customers in identifying AI use cases suitable for Google Cloud AI products and solutions. Articulate key solution differentiators and the measurable business impact.<br></li>\n<li>Develop and execute strategic account plans, including a broader enterprise plan across key verticals.<br></li>\n<li>Work with Google Account and Technical teams to develop and drive pipelines, and provide expertise. Execute Go-To-Market (GTM) business plays and related efforts with the Cloud teams and GCP partners.<br></li>\n</ul></div>"}
]


